In this notebook, I will be tackling a project of creating a nairobi house price prediction model that will help determine the prices of houses in narobi with respect to the various features. This concept that we shall touch on today will be applicable to any house price prediction not just nairobi. I plan to use a very dirty dataset so tha we can get the chance to sharpen our logic senses, apply then concepts of mathematical calculus and statistics and also know how to tackle such a data in any other occurrence. I hope you enjoy. Lets do some coding

In [1]:
# below are the libraries we shall be using with their uses described.
"""
pandas for data manipulation and analysis.
numpy for numerical operations.
matplotlib.pyplot and seaborn for data visualization.
train_test_split from sklearn.model_selection to split the data into training and test sets.
LinearRegression from sklearn.linear_model for linear regression (you can use this for comparison with XGBoost).
mean_squared_error and r2_score from sklearn.metrics to evaluate the model performance.
xgboost for the XGBoost regression model.
"""
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score
import xgboost as xgb
from sklearn.preprocessing import LabelEncoder
from sklearn import metrics

In [2]:
df = pd.read_csv("houses-for-sale.csv")
df

,title,location,size,selling price
0,6 Bed Villa with En Suite at Kiambu Road,Kiambu Road,"6bdrm Mansion in Mushroom Estate, Kiambu / Kia...","KSh 130,000,000"
1,4 Bed Townhouse with En Suite at Off Kiambu Road,"Off Kiambu Road, Kiambu Road",4 Bedroom with DSQ for Sale,"KSh 26,950,000"
2,4 Bed Villa with En Suite at Masai Lodge Road,"masai lodge road, Ongata Rongai",New modern villa for sale.,"KSh 16,000,000"
3,5 Bed House with En Suite in Ngong Road,Ngong Road,5 Bedroom Town House For Sale In Kilimani,"KSh 45,000,000"
4,5 Bed Townhouse with En Suite in Lavington,Lavington,Modern 5 Bedroom Townhouse For Sale,"KSh 72,000,000"
...,...,...,...,...
1871,5 Bed House with En Suite at Nandi Road,"Nandi road, Karen",5 BEDROOM HOUSE FOR SALE IN KAREN NAIROBI KENYA,"KSh 199,000,000"
1872,4 Bed House with En Suite in Kitengela,Kitengela,4 Bedroom Maisonette for Sale in Kitengela EPZ...,"KSh 16,000,000"
1873,4 Bed House with En Suite in Syokimau,Syokimau,4 BEDROOMS MAISONETTE IN SYOKIMAU.,"KSh 13,800,000"
1874,4 Bed Townhouse with Garden in Lavington,Lavington,4 bedroom townhouse for sale in Lavington,"KSh 79,000,000"
1875,3 Bed House with En Suite at Kimbo Matangi,"Kimbo Matangi, Ruiru",READY AFFORDABLE BUNGALOWS ON OFFER,"KSh 7,800,000"

# Data overview
   - Obcervations
   - Sanity checks

In [3]:
# we first confirm for null values and were off for a good start.
df.isnull().sum()

title            0
location         0
size             0
selling price    0
dtype: int64

Just because there is no null values, this is not proof enough that our dataset is clean and we can start
working with it. Use more prompts to check for unique values, duplicates, dtypes, and at times desriptive
statustics. This tend to be very insightful from a mathematical and logical point of view.

In [4]:
df.dtypes

title            object
location         object
size             object
selling price    object
dtype: object

Notice that all, the features contain dtype object. We will change this later on to maje sure we have everything as the appropriate dtype.

In [5]:
df['title'].unique()

array(['6 Bed Villa with En Suite at Kiambu Road',
       '4 Bed Townhouse with En Suite at Off Kiambu Road',
       '4 Bed Villa with En Suite at Masai Lodge Road', ...,
       '3 Bed House with En Suite at Kona Ya Musa',
       '3 Bed House with En Suite in Kileleshwa',
       '5 Bed House with En Suite at Nandi Road'], dtype=object)

 You can notice how wranglled the tittle column is. we can can come up with almost more that two new features that can be very important in our analysis. In this case, I shall apply a regex function that willl beak the title column to bera new columns namels; number_of_bedrooms, house_type, location, and amenities. This will become very crucial during model training since they all determine the price of a house hold

In [6]:
df['selling price'].unique()

array(['KSh 130,000,000', 'KSh 26,950,000', 'KSh 16,000,000',
       'KSh 45,000,000', 'KSh 72,000,000', 'KSh 46,000,000',
       'KSh 85,000,000', 'KSh 50,000,000', 'KSh 75,000,000',
       'KSh 500,000,000', 'KSh 140,000,000', 'KSh 15,000,000',
       'KSh 60,000,000', 'KSh 55,000,000', 'Price not communicated',
       'KSh 427,000,000', 'KSh 65,000,000', 'KSh 48,000,000',
       'KSh 88,000,000', 'KSh 27,000,000', 'KSh 150,000,000',
       'KSh 120,000,000', 'KSh 110,000,000', 'KSh 90,000,000',
       'KSh 35,000,000', 'KSh 59,000,000', 'KSh 95,000,000',
       'KSh 24,000,000', 'KSh 20,000,000', 'KSh 23,000,000',
       'KSh 115,000,000', 'KSh 38,000,000', 'KSh 16,500,000',
       'KSh 32,250,000', 'KSh 39,000,000', 'KSh 9,500,000',
       'KSh 28,000,000', 'KSh 8,950,000', 'KSh 50,600,000',
       'KSh 70,250,000', 'KSh 19,000,000', 'KSh 155,000,000',
       'KSh 180,000,000', 'KSh 38,500,000', 'KSh 5,300,000',
       'KSh 8,500,000', 'KSh 29,999,000', 'KSh 25,000,000',
       'KSh 72,499,999', 'KSh 7,200,000', 'KSh 6,500,000',
       'KSh 26,500,000', 'KSh 17,000,000', 'KSh 64,990,000',
       'KSh 70,000,000', 'KSh 30,500,000', 'KSh 100,000,000',
       'KSh 29,500,000', 'KSh 15,500,000', 'KSh 14,500,000',
       'KSh 7,500,000', 'KSh 31,500,000', 'KSh 16,200,000',
       'KSh 6,800,000', 'KSh 11,500,000', 'KSh 295,000,000',
       'KSh 10,300,000', 'KSh 14,000,000', 'KSh 22,500,000',
       'KSh 121,000,000', 'KSh 8,850,000', 'KSh 170,000,000',
       'KSh 99,000,000', 'KSh 7,600,000', 'KSh 83,000,000',
       'KSh 12,500,000', 'KSh 31,000,000', 'KSh 7,700,000',
       'KSh 40,000,000', 'KSh 18,500,000', 'KSh 19,500,000',
       'KSh 74,000,000', 'KSh 69,000,000', 'KSh 160,000,000',
       'KSh 145,000,000', 'KSh 34,000,000', 'KSh 13,000,000',
       'KSh 10,500,000', 'KSh 21,000,000', 'KSh 17,500,000',
       'KSh 30,000,000', 'KSh 12,600,000', 'KSh 13,500,000',
       'KSh 64,000,000', 'KSh 16,499,000', 'KSh 56,000,000',
       'KSh 350,000,000', 'KSh 11,950,000', 'KSh 6,100,000',
       'KSh 12,100,000', 'KSh 26,000,000', 'KSh 11,000,000',
       'KSh 300,000,000', 'KSh 125,000,000', 'KSh 68,000,000',
       'KSh 14,200,000', 'KSh 6,750,000', 'KSh 63,000,000',
       'KSh 22,000,000', 'KSh 66,000,000', 'KSh 6,000,000',
       'KSh 650,000,000', 'KSh 29,000,000', 'KSh 105,000,000',
       'KSh 135,000,000', 'KSh 200,000,000', 'KSh 12,000,000',
       'KSh 250,000,000', 'KSh 58,000,000', 'KSh 4,500,000',
       'KSh 80,000,000', 'KSh 5,700,000', 'KSh 33,000,000',
       'KSh 67,000,000', 'KSh 27,500,000', 'KSh 67,500,000',
       'KSh 7,800,000', 'KSh 25,945,000', 'KSh 37,000,000',
       'KSh 43,000,000', 'KSh 61,950,000', 'KSh 24,500,000',
       'KSh 87,000,000', 'KSh 128,000,000', 'KSh 37,500,000',
       'KSh 6,300,000', 'KSh 7,000,000', 'KSh 8,000,000', 'KSh 5,800,000',
       'KSh 78,000,000', 'KSh 13,800,000', 'KSh 220,000,000',
       'KSh 19,250,000', 'KSh 8,150,000', 'KSh 165,000,000',
       'KSh 12,300,000', 'KSh 14,750,000', 'KSh 29,990,000',
       'KSh 41,000,000', 'KSh 40,750,000', 'KSh 36,000,000',
       'KSh 10,250,000', 'KSh 32,000,000', 'KSh 7,250,000',
       'KSh 10,000,000', 'KSh 28,500,000', 'KSh 32,500,000',
       'KSh 190,000,000', 'KSh 5,750,000', 'KSh 97,000,000',
       'KSh 18,000,000', 'KSh 230,000,000', 'KSh 6,700,000',
       'KSh 9,000,000', 'KSh 20,500,000', 'KSh 6,200,000',
       'KSh 6,400,000', 'KSh 14,800,000', 'KSh 7,400,000',
       'KSh 11,300,000', 'KSh 52,000,000', 'KSh 39,500,000',
       'KSh 42,000,000', 'KSh 185,000,000', 'KSh 50,950,000',
       'KSh 7,900,000', 'KSh 5,850,000', 'KSh 400,000,000',
       'KSh 235,000,000', 'KSh 6,950,000', 'KSh 46,750,000',
       'KSh 108,500,000', 'KSh 225,000,000', 'KSh 280,000,000',
       'KSh 240,000,000', 'KSh 9,980,000', 'KSh 12,800,000',
       'KSh 6,250,000', 'KSh 86,000,000', 'KSh 40,500,000',
       'KSh 35,800,000', 'KSh 35,500,000', 'KSh 29,900,000',
       'KSh 19,950,000', 'KSh 47,000,000', 'KSh 111,000,000',
       'KSh 2,700,000', 'KSh 92,000,000', 'KSh 3,700,000',
       'KSh 5,500,000', 'KSh 82,000,000', 'KSh 8,800,000',
       'KSh 59,500,000', 'KSh 11,800,000', 'KSh 87,500,000',
       'KSh 210,000,000', 'KSh 11,250,000', 'KSh 158,145,000',
       'KSh 97,500,000', 'KSh 36,500,000', 'KSh 290,000,000',
       'KSh 49,000,000', 'KSh 107,000,000', 'KSh 16,850,000',
       'KSh 62,000,000', 'KSh 7,950,000', 'KSh 21,817,000',
       'KSh 270,000,000', 'KSh 25,500,000', 'KSh 123,000,000',
       'KSh 20,950,000', 'KSh 600,000,000', 'KSh 245,403,755',
       'KSh 48,450,000', 'KSh 69,500,000', 'KSh 81,420,000',
       'KSh 15,800,000', 'KSh 29,980,000', 'KSh 9,950,000',
       'KSh 61,000,000', 'KSh 13,100,000', 'KSh 118,500,000',
       'KSh 10,950,000', 'KSh 4,600,000', 'KSh 63,950,000',
       'KSh 550,000,000', 'KSh 19,700,000', 'KSh 49,500,000',
       'KSh 299,700,000', 'KSh 28,250,000', 'KSh 260,000,000',
       'KSh 7,300,000', 'KSh 43,580,000', 'KSh 34,450,000',
       'KSh 47,500,000', 'KSh 68,500,000', 'KSh 9,250,000',
       'KSh 340,000,000', 'KSh 480,000,000', 'KSh 8,600,000',
       'KSh 14,150,000', 'KSh 684,000,000', 'KSh 34,400,000',
       'KSh 15,900,000', 'KSh 275,000,000', 'KSh 29,700,000',
       'KSh 171,375,000', 'KSh 133,000,000', 'KSh 21,950,000',
       'KSh 118,000,000', 'KSh 57,000,000', 'KSh 11,700,000',
       'KSh 98,000,000', 'KSh 13,600,000', 'KSh 12,700,000',
       'KSh 53,000,000', 'KSh 220,863,379', 'KSh 10,900,000',
       'KSh 5,990,000', 'KSh 17,800,000', 'KSh 4,800,000',
       'KSh 45,800,000', 'KSh 5,250,000', 'KSh 4,450,000',
       'KSh 8,700,000', 'KSh 648,000,000', 'KSh 26,800,000',
       'KSh 20,295,000', 'KSh 11,980,000', 'KSh 29,400,000',
       'KSh 138,000,000', 'KSh 12,980,000', 'KSh 132,000,000',
       'KSh 211,840,000', 'KSh 42,500,000', 'KSh 54,000,000',
       'KSh 21,500,000', 'KSh 23,500,000', 'KSh 29,850,000',
       'KSh 10,050,000', 'KSh 7,499,000', 'KSh 199,000,000',
       'KSh 79,000,000'], dtype=object)

This column selling price is also a bit mixed. We have some of the readings as "Price not communicated" thus we need to come up with a strategy to handle this. Also later on, we shall remove the prefix "Ksh" which states the currency type to be left with only integers. Buckle up, this shall be a train ride.

# Data Preprocessing
   - Missing value treatment (if needed)
   - Feature engineering
   - Outlier detection and treatment (if needed)
   - Preparing data for modeling
   - Any other preprocessing steps (if needed)

Creating a copy of the dataset and working on the copy is a trend that not most people use. I find this trend very useful especially if we are working on a very crucial dataset. We might make a mistake, and this might cost us alot if we are working on the original piece. 
Work on the duplicate and once everything looks ood, you can choose to push the changes to the original dataset. This is just my view though.

In [7]:
# create copy of dataset
df1= df.copy()

In [8]:
import re
# Define a function to extract property type, number of bedrooms, and amenities from the title
def extract_info(title):
    # Extract the number of bedrooms
    bedrooms = re.search('(\d+) Bed', title)
    if bedrooms:
        bedrooms = bedrooms.group(1)
    else:
        bedrooms = 'Unknown'
    
    # Extract property type
    property_type = re.search('([a-zA-Z]+) with', title)
    if property_type:
        property_type = property_type.group(1)
    else:
        property_type = 'Unknown'
    
    # Extract amenities
    amenities = []
    for amenity in ['En Suite', 'Swimming Pool', 'Gym', 'Garden', 'Backup Generator', 'DSQ']:
        if amenity.lower() in title.lower():
            amenities.append(amenity)
    amenities_str = ', '.join(amenities) if amenities else 'Unknown'
    
    return bedrooms, property_type, amenities_str

# Apply the function to the 'title' column
df1[['bedrooms', 'property_type', 'amenities']] = df1['title'].apply(lambda x: pd.Series(extract_info(x)))

In [9]:
# Displaying the first few rows of the DataFrame
df1 = df1.drop(['title', 'size'], axis = 1)
df1

,location,selling price,bedrooms,property_type,amenities
0,Kiambu Road,"KSh 130,000,000",6,Villa,En Suite
1,"Off Kiambu Road, Kiambu Road","KSh 26,950,000",4,Townhouse,En Suite
2,"masai lodge road, Ongata Rongai","KSh 16,000,000",4,Villa,En Suite
3,Ngong Road,"KSh 45,000,000",5,House,En Suite
4,Lavington,"KSh 72,000,000",5,Townhouse,En Suite
...,...,...,...,...,...
1871,"Nandi road, Karen","KSh 199,000,000",5,House,En Suite
1872,Kitengela,"KSh 16,000,000",4,House,En Suite
1873,Syokimau,"KSh 13,800,000",4,House,En Suite
1874,Lavington,"KSh 79,000,000",4,Townhouse,Garden
1875,"Kimbo Matangi, Ruiru","KSh 7,800,000",3,House,En Suite

In [10]:
# Remove 'KSh' prefix from 'selling_price'
df1['selling price'] = df1['selling price'].str.replace('KSh ', '')
df1

,location,selling price,bedrooms,property_type,amenities
0,Kiambu Road,"130,000,000",6,Villa,En Suite
1,"Off Kiambu Road, Kiambu Road","26,950,000",4,Townhouse,En Suite
2,"masai lodge road, Ongata Rongai","16,000,000",4,Villa,En Suite
3,Ngong Road,"45,000,000",5,House,En Suite
4,Lavington,"72,000,000",5,Townhouse,En Suite
...,...,...,...,...,...
1871,"Nandi road, Karen","199,000,000",5,House,En Suite
1872,Kitengela,"16,000,000",4,House,En Suite
1873,Syokimau,"13,800,000",4,House,En Suite
1874,Lavington,"79,000,000",4,Townhouse,Garden
1875,"Kimbo Matangi, Ruiru","7,800,000",3,House,En Suite

We shall do stanerdization of capitalization to our feilds location, property_type and amenities.

Consistency: It helps maintain consistency in the dataset or document, making it easier to read and analyze.

Analysis: Standardization can make it easier to perform text analysis, such as searching for specific terms or conducting natural language processing tasks.

Comparison: It enables easier comparison between texts, as differences in capitalization won't affect the comparison.

Readability: Consistent capitalization can improve the overall readability of the text.

In [11]:
# Convert the 'location' column to lowercase
df1['location'] = df1['location'].str.lower()
df1['property_type'] = df1['property_type'].str.lower()
df1['amenities'] = df1['amenities'].str.lower()
df1

,location,selling price,bedrooms,property_type,amenities
0,kiambu road,"130,000,000",6,villa,en suite
1,"off kiambu road, kiambu road","26,950,000",4,townhouse,en suite
2,"masai lodge road, ongata rongai","16,000,000",4,villa,en suite
3,ngong road,"45,000,000",5,house,en suite
4,lavington,"72,000,000",5,townhouse,en suite
...,...,...,...,...,...
1871,"nandi road, karen","199,000,000",5,house,en suite
1872,kitengela,"16,000,000",4,house,en suite
1873,syokimau,"13,800,000",4,house,en suite
1874,lavington,"79,000,000",4,townhouse,garden
1875,"kimbo matangi, ruiru","7,800,000",3,house,en suite

Remember when we were checking through our data for anomalies, we did notice that the selling price column had records where the prices were not mentioned and noted as "Price not communicated". There was
several ways to deal with this where one bwas to delete the records and work with the rest. Since i did not want to deleta any records from my data set, I had to amputate these records with the average values af houses that are located in the same location, and have a chance of having almost the same no. of rooms. This was quite hectic process since I had ri group the data into location and no.of  bedrooms then find the average, then create a new df where i could fix the mising records.

In [12]:
# Create a copy of the original DataFrame to work with
df2 = df1.copy()

# Remove commas from 'selling price' and convert to numeric, ignoring errors to handle 'Price not communicated'
df2['selling price'] = pd.to_numeric(df2['selling price'].str.replace(',', ''), errors='coerce')

# Group by 'location' and 'bedrooms', calculate the mean selling price
location_bedrooms_means = df2.groupby(['location', 'bedrooms'])['selling price'].mean()

# Fill missing 'selling_price' values based on the calculated means
for index, row in df2.iterrows():
    if pd.isnull(row['selling price']):  # Check if the selling price is missing
        location = row['location']
        bedrooms = row['bedrooms']
        # Use the mean for the location and closest number of bedrooms
        try:
            df2.at[index, 'selling price'] = location_bedrooms_means.loc[location, bedrooms]
        except KeyError:
            # If the exact number of bedrooms is not found, try the closest one
            bedrooms = min(location_bedrooms_means.loc[location].index, key=lambda x: abs(x - bedrooms))
            df2.at[index, 'selling price'] = location_bedrooms_means.loc[location, bedrooms]

# Convert 'selling_price' back to string format
df2['selling price'] = df2['selling price'].apply(lambda x: f"KSh {x:,.2f}")

In [13]:
# Display the df
df2

,location,selling price,bedrooms,property_type,amenities
0,kiambu road,"KSh 130,000,000.00",6,villa,en suite
1,"off kiambu road, kiambu road","KSh 26,950,000.00",4,townhouse,en suite
2,"masai lodge road, ongata rongai","KSh 16,000,000.00",4,villa,en suite
3,ngong road,"KSh 45,000,000.00",5,house,en suite
4,lavington,"KSh 72,000,000.00",5,townhouse,en suite
...,...,...,...,...,...
1871,"nandi road, karen","KSh 199,000,000.00",5,house,en suite
1872,kitengela,"KSh 16,000,000.00",4,house,en suite
1873,syokimau,"KSh 13,800,000.00",4,house,en suite
1874,lavington,"KSh 79,000,000.00",4,townhouse,garden
1875,"kimbo matangi, ruiru","KSh 7,800,000.00",3,house,en suite

In [26]:
df2[df2['selling price'] == 'Price not communicated']

Empty DataFrame
Columns: [location, selling price, bedrooms, property_type, amenities]
Index: []

In [27]:
df2['selling price'].unique()

array(['130000000', '26950000', '16000000', '45000000', '72000000',
       '46000000', '85000000', '50000000', '75000000', '500000000',
       '140000000', '15000000', '60000000', '55000000',
       'Pricenotcommunicated', '427000000', '65000000', '48000000',
       '88000000', '27000000', '150000000', '120000000', '110000000',
       '90000000', '35000000', '59000000', '95000000', '24000000',
       '20000000', '23000000', '115000000', '38000000', '16500000',
       '32250000', '39000000', '9500000', '28000000', '8950000',
       '50600000', '70250000', '19000000', '155000000', '180000000',
       '38500000', '5300000', '8500000', '29999000', '25000000',
       '72499999', '7200000', '6500000', '26500000', '17000000',
       '64990000', '70000000', '30500000', '100000000', '29500000',
       '15500000', '14500000', '7500000', '31500000', '16200000',
       '6800000', '11500000', '295000000', '10300000', '14000000',
       '22500000', '121000000', '8850000', '170000000', '99000000',
       '7600000', '83000000', '12500000', '31000000', '7700000',
       '40000000', '18500000', '19500000', '74000000', '69000000',
       '160000000', '145000000', '34000000', '13000000', '10500000',
       '21000000', '17500000', '30000000', '12600000', '13500000',
       '64000000', '16499000', '56000000', '350000000', '11950000',
       '6100000', '12100000', '26000000', '11000000', '300000000',
       '125000000', '68000000', '14200000', '6750000', '63000000',
       '22000000', '66000000', '6000000', '650000000', '29000000',
       '105000000', '135000000', '200000000', '12000000', '250000000',
       '58000000', '4500000', '80000000', '5700000', '33000000',
       '67000000', '27500000', '67500000', '7800000', '25945000',
       '37000000', '43000000', '61950000', '24500000', '87000000',
       '128000000', '37500000', '6300000', '7000000', '8000000',
       '5800000', '78000000', '13800000', '220000000', '19250000',
       '8150000', '165000000', '12300000', '14750000', '29990000',
       '41000000', '40750000', '36000000', '10250000', '32000000',
       '7250000', '10000000', '28500000', '32500000', '190000000',
       '5750000', '97000000', '18000000', '230000000', '6700000',
       '9000000', '20500000', '6200000', '6400000', '14800000', '7400000',
       '11300000', '52000000', '39500000', '42000000', '185000000',
       '50950000', '7900000', '5850000', '400000000', '235000000',
       '6950000', '46750000', '108500000', '225000000', '280000000',
       '240000000', '9980000', '12800000', '6250000', '86000000',
       '40500000', '35800000', '35500000', '29900000', '19950000',
       '47000000', '111000000', '2700000', '92000000', '3700000',
       '5500000', '82000000', '8800000', '59500000', '11800000',
       '87500000', '210000000', '11250000', '158145000', '97500000',
       '36500000', '290000000', '49000000', '107000000', '16850000',
       '62000000', '7950000', '21817000', '270000000', '25500000',
       '123000000', '20950000', '600000000', '245403755', '48450000',
       '69500000', '81420000', '15800000', '29980000', '9950000',
       '61000000', '13100000', '118500000', '10950000', '4600000',
       '63950000', '550000000', '19700000', '49500000', '299700000',
       '28250000', '260000000', '7300000', '43580000', '34450000',
       '47500000', '68500000', '9250000', '340000000', '480000000',
       '8600000', '14150000', '684000000', '34400000', '15900000',
       '275000000', '29700000', '171375000', '133000000', '21950000',
       '118000000', '57000000', '11700000', '98000000', '13600000',
       '12700000', '53000000', '220863379', '10900000', '5990000',
       '17800000', '4800000', '45800000', '5250000', '4450000', '8700000',
       '648000000', '26800000', '20295000', '11980000', '29400000',
       '138000000', '12980000', '132000000', '211840000', '42500000',
       '54000000', '21500000', '23500000', '29850000', '10050000',
       '7499000', '199000000', '79000000'], dtype=object)

In [28]:
df2 = df2[df2['bedrooms'] != 'Unknown']
df2 = df2[df2['selling price'] != 'Pricenotcommunicated']
df2 = df2[df2['selling price'] != '']

In [29]:
df2['selling price'] = df1['selling price'].str.replace('KSh ', '')
df2

,location,selling price,bedrooms,property_type,amenities
0,kiambu road,"130,000,000",6,villa,en suite
1,"off kiambu road, kiambu road","26,950,000",4,townhouse,en suite
2,"masai lodge road, ongata rongai","16,000,000",4,villa,en suite
3,ngong road,"45,000,000",5,house,en suite
4,lavington,"72,000,000",5,townhouse,en suite
...,...,...,...,...,...
1871,"nandi road, karen","199,000,000",5,house,en suite
1872,kitengela,"16,000,000",4,house,en suite
1873,syokimau,"13,800,000",4,house,en suite
1874,lavington,"79,000,000",4,townhouse,garden
1875,"kimbo matangi, ruiru","7,800,000",3,house,en suite

In [30]:
df2['bedrooms'].unique()

array(['6', '4', '5', '3', '8', '2', '7', '10', '1', '9'], dtype=object)

In [31]:
df2['selling price'].unique()

array(['130,000,000', '26,950,000', '16,000,000', '45,000,000',
       '72,000,000', '46,000,000', '85,000,000', '50,000,000',
       '75,000,000', '500,000,000', '140,000,000', '15,000,000',
       '60,000,000', '55,000,000', '427,000,000', '65,000,000',
       '48,000,000', '88,000,000', '27,000,000', '150,000,000',
       '120,000,000', '110,000,000', '90,000,000', '35,000,000',
       '59,000,000', '95,000,000', '24,000,000', '20,000,000',
       '23,000,000', '115,000,000', '38,000,000', '16,500,000',
       '32,250,000', '39,000,000', '9,500,000', '28,000,000', '8,950,000',
       '50,600,000', '70,250,000', '19,000,000', '155,000,000',
       '180,000,000', '38,500,000', '5,300,000', '8,500,000',
       '29,999,000', '25,000,000', '72,499,999', '7,200,000', '6,500,000',
       '26,500,000', '17,000,000', '64,990,000', '70,000,000',
       '30,500,000', '100,000,000', '29,500,000', '15,500,000',
       '14,500,000', '7,500,000', '31,500,000', '16,200,000', '6,800,000',
       '11,500,000', '295,000,000', '10,300,000', '14,000,000',
       '22,500,000', '121,000,000', '8,850,000', '170,000,000',
       '99,000,000', '7,600,000', '83,000,000', '12,500,000',
       '31,000,000', '7,700,000', '40,000,000', '18,500,000',
       '19,500,000', '74,000,000', '69,000,000', '160,000,000',
       '145,000,000', '34,000,000', '13,000,000', '10,500,000',
       '21,000,000', '17,500,000', '30,000,000', '12,600,000',
       '13,500,000', '64,000,000', '16,499,000', '56,000,000',
       '350,000,000', '11,950,000', '6,100,000', '12,100,000',
       '26,000,000', '11,000,000', '300,000,000', '125,000,000',
       '68,000,000', '14,200,000', '6,750,000', '63,000,000',
       '22,000,000', '66,000,000', '6,000,000', '650,000,000',
       '29,000,000', '105,000,000', '135,000,000', '200,000,000',
       '12,000,000', '250,000,000', '58,000,000', '4,500,000',
       '80,000,000', '5,700,000', '33,000,000', '67,000,000',
       '27,500,000', '67,500,000', '7,800,000', '25,945,000',
       '37,000,000', '43,000,000', '61,950,000', '24,500,000',
       '87,000,000', '128,000,000', '37,500,000', '6,300,000',
       '7,000,000', '8,000,000', '5,800,000', '78,000,000', '13,800,000',
       '220,000,000', '19,250,000', '8,150,000', '165,000,000',
       '12,300,000', '14,750,000', '29,990,000', '41,000,000',
       '40,750,000', '36,000,000', '10,250,000', '32,000,000',
       '7,250,000', '10,000,000', '28,500,000', '32,500,000',
       '190,000,000', '5,750,000', '97,000,000', '18,000,000',
       '230,000,000', '6,700,000', '9,000,000', '20,500,000', '6,200,000',
       '6,400,000', '14,800,000', '7,400,000', '11,300,000', '52,000,000',
       '39,500,000', '42,000,000', '185,000,000', '50,950,000',
       '7,900,000', '5,850,000', '400,000,000', '235,000,000',
       '6,950,000', '46,750,000', '108,500,000', '225,000,000',
       '280,000,000', '240,000,000', '9,980,000', '12,800,000',
       '6,250,000', '86,000,000', '40,500,000', '35,800,000',
       '35,500,000', '29,900,000', '19,950,000', '47,000,000',
       '111,000,000', '2,700,000', '92,000,000', '3,700,000', '5,500,000',
       '82,000,000', '8,800,000', '59,500,000', '11,800,000',
       '87,500,000', '210,000,000', '11,250,000', '158,145,000',
       '97,500,000', '36,500,000', '290,000,000', '49,000,000',
       '107,000,000', '16,850,000', '62,000,000', '7,950,000',
       '21,817,000', '270,000,000', '25,500,000', '123,000,000',
       '20,950,000', '600,000,000', '245,403,755', '48,450,000',
       '69,500,000', '81,420,000', '15,800,000', '29,980,000',
       '9,950,000', '61,000,000', '13,100,000', '118,500,000',
       '10,950,000', '4,600,000', '63,950,000', '550,000,000',
       '19,700,000', '49,500,000', '299,700,000', '28,250,000',
       '260,000,000', '7,300,000', '43,580,000', '34,450,000',
       '47,500,000', '68,500,000', '9,250,000', '340,000,000',
       '480,000,000', '8,600,000', '14,150,000', '684,000,000',
       '34,400,000', '15,900,000', '275,000,000', '29,700,000',
       '171,375,000', '133,000,000', '21,950,000', '118,000,000',
       '57,000,000', '11,700,000', '98,000,000', '13,600,000',
       '12,700,000', '53,000,000', '220,863,379', '10,900,000',
       '5,990,000', '17,800,000', '4,800,000', '45,800,000', '5,250,000',
       '4,450,000', '8,700,000', '648,000,000', '26,800,000',
       '20,295,000', '11,980,000', '29,400,000', '138,000,000',
       '12,980,000', '132,000,000', '211,840,000', '42,500,000',
       '54,000,000', '21,500,000', '23,500,000', '29,850,000',
       '10,050,000', '7,499,000', '199,000,000', '79,000,000'],
      dtype=object)

In [35]:
# Remove white spaces and commas from values in the 'selling price' column
df2['selling price'] = df2['selling price'].astype(str).str.replace(' ', '').str.replace(',', '')

# Convert the 'selling price' column to integer
df2['selling price'] = df2['selling price'].astype(int)

# Convert the 'bedrooms' column to integer
df2['bedrooms'] = df2['bedrooms'].astype(int)

# Model Bulding - LinearRegression

In [53]:
# # LABEL ENCODING
# df2 = pd.get_dummies(df2, columns=['location', 'property_type', 'amenities'], drop_first=True, dtype='int8')
# df2
df2

,selling price,bedrooms,"location_01, ongata rongai","location_01, runda, runda, westlands","location_01, runda, westlands","location_012, kimlat, kitengela","location_0208, ngong road, ngong","location_04, gateway mall, syokimau","location_046, kindaruma road, kilimani","location_0706771810, bamburi mwisho, bamburi",...,"location_yukos, kitengela",property_type_townhouse,property_type_unknown,property_type_villa,amenities_en suite,"amenities_en suite, garden",amenities_garden,amenities_gym,amenities_swimming pool,amenities_unknown
0,130000000,6,0,0,0,0,0,0,0,0,...,0,0,0,1,1,0,0,0,0,0
1,26950000,4,0,0,0,0,0,0,0,0,...,0,1,0,0,1,0,0,0,0,0
2,16000000,4,0,0,0,0,0,0,0,0,...,0,0,0,1,1,0,0,0,0,0
3,45000000,5,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,72000000,5,0,0,0,0,0,0,0,0,...,0,1,0,0,1,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1871,199000000,5,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1872,16000000,4,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1873,13800000,4,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1874,79000000,4,0,0,0,0,0,0,0,0,...,0,1,0,0,0,0,1,0,0,0
1875,7800000,3,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [54]:
y = df2['selling price']
X = df2.drop('selling price', axis =1)

In [55]:
#feature engineering
from sklearn.preprocessing import PolynomialFeatures
poly = PolynomialFeatures(degree=2)
X_poly = poly.fit_transform(X)

In [56]:
#feature scalling
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X_scaled = scaler.fit_transform(X)

In [57]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 1)

In [58]:
#gradient boosting
from sklearn.ensemble import GradientBoostingRegressor
gb = GradientBoostingRegressor()
gb.fit(X_train, y_train)

GradientBoostingRegressor()

In [59]:
# rifge regression
from sklearn.linear_model import Ridge
ridge = Ridge(alpha=1.0)
ridge.fit(X_train, y_train)

Ridge()

In [60]:
#model selection
from sklearn.ensemble import RandomForestRegressor
rf = RandomForestRegressor()
rf.fit(X_train, y_train)

RandomForestRegressor()

In [61]:
print("Number of rows in train data =", X_train.shape[0])
print("Number of rows in test data =", X_test.shape[0])

Number of rows in train data = 1477
Number of rows in test data = 370

In [62]:
lm = LinearRegression()

In [63]:
#hyperparameter Tuning
from sklearn.model_selection import GridSearchCV
params = {'n_estimators': [100, 200, 300], 'max_depth': [10, 20, 30]}
grid_search = GridSearchCV(rf, param_grid=params, cv=5)
grid_search.fit(X_train, y_train)

GridSearchCV(cv=5, estimator=RandomForestRegressor(),
             param_grid={'max_depth': [10, 20, 30],
                         'n_estimators': [100, 200, 300]})

In [65]:
lm.fit(X_train, y_train)

LinearRegression()

In [66]:
#crosss validation (k-fold)
from sklearn.model_selection import cross_val_score
scores = cross_val_score(rf, X_train, y_train, cv=5, scoring='neg_mean_squared_error')

In [ ]:
# Extract the intercept, or y-cut, of our linear model
a = float(lm.intercept_)
# Extract the coefficient, or gradient, of our linear model
b = lm.coef_

In [ ]:
print("Slope:\t\t", b)
print("Intercept:\t", float(a))

# Model performance check

In [67]:
# Generate predictions on the training set
y_train_pred = lm.predict(X_train)

# Calculate the Mean Squared Error (MSE)
train_mse = metrics.mean_squared_error(y_train, y_train_pred)

# Calculate the R-squared
train_r2 = metrics.r2_score(y_train, y_train_pred)

# Print the training MSE and R-squared score
print("Training MSE:", train_mse)
print("Training R-squared:", train_r2)

Training MSE: 1099726801155672.2
Training R-squared: 0.7820668706257982

In [68]:
# Your solution here...
# Generate predictions on the testing set
y_test_pred = lm.predict(X_test)

# Calculate the Mean Squared Error (MSE)
test_mse = metrics.mean_squared_error(y_test, y_test_pred)

# Calculate the R-squared
test_r2 = metrics.r2_score(y_test, y_test_pred)

# Print the testing MSE and R-squared score
print("Testing MSE:", test_mse)
print("Testing R-squared:", test_r2)

Testing MSE: 1.4153579376362048e+40
Testing R-squared: -2.8837743267611474e+24

In [69]:
# Make predictions on the test data
y_pred = lm.predict(X_test)

# Evaluate the model
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)

print(f"Mean Squared Error: {mse}")
print(f"R^2 Score: {r2}")

Mean Squared Error: 1.4153579376362048e+40
R^2 Score: -2.8837743267611474e+24